---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsLanding.IsAutomaticLanding
source: html/3eb3c125-de9d-bb0d-4463-a1443e2a3338.htm
---
# Autodesk.Revit.DB.Architecture.StairsLanding.IsAutomaticLanding Property

True if the landing is an automatic landing, False otherwise.

## Syntax (C#)
```csharp
public bool IsAutomaticLanding { get; }
```